/**************************************************************************************
实验现象：下载程序后"LED&交通灯模块"的D1指示灯闪烁
接线说明： 单片机-->LED&交通灯模块(具体接线图可见开发攻略对应实验的“实验现象”章节)
		   P00-->D1	
注意事项：无																				  
***************************************************************************************/

#include "reg51.h"	//此文件中定义了单片机的一些特殊功能寄存器，导入头文件
#define uint unsigned int	//宏定义两个无符号数据类型，方便引用
#define uchar unsigned char

sbit led=P0^0;		 //将单片机的P0.0端口定义为led

void delay(uint i){
	while(i--);	
}

void main(){
	while(1){
		led=0;		  //LED灯亮
		delay(50000); //调用延时函数，大约延时450ms
		led=1;		  //LED灯灭
		delay(50000); //调用延时函数，大约延时450ms	
	}		
}
