/**************************************************************************************
实验现象：下载程序后"动态数码管模块"从左至右循环显示0-7
接线说明： 单片机-->动态数码管模块(具体接线图可见开发攻略对应实验的“实验现象”章节)
		   J22-->J6
				P22-->J9(A)
				P23-->J9(B)
				P24-->J9(C)		
注意事项：无																			  
***************************************************************************************/

#include "reg51.h"			 //此文件中定义了单片机的一些特殊功能寄存器

#define uint unsigned int	 //宏定义两个无符号数据类型
#define uchar unsigned char	 

sbit LSA = P2^2;	//将74HC138模块的38译码器LSA口接到P2.2口
sbit LSB = P2^3;	//将74HC138模块的38译码器LSB口接到P2.3口
sbit LSC = P2^4;	//将74HC138模块的38译码器LSC口接到P2.4口	

uchar code smgduan[17] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,
					0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71};//共阴显示0~F的值码表

/*******************************************************************************
* 函 数 名         : delay
* 函数功能		   : 延时函数，延时1秒
*******************************************************************************/
void delay(void){	//1秒的延时函数
	uchar h,i,j,k;
	for(h = 5;h > 0;h--)
	for(i = 4;i > 0;i--)
	for(j = 116;j > 0;j--)
	for(k = 214;k > 0;k--);	
}	
/*******************************************************************************
* 函 数 名         : DigDisplay
* 函数功能		   : 数码管动态扫描函数，循环扫描8个数码管显示
*******************************************************************************/
void DigDisplay()
{
	uint i;
	for(i = 0;i < 8;i++)
	{
		switch(i)	 //位选，选择点亮的数码管，
		{
			case(0):
				LSA = 0;LSB = 0;LSC = 0; break;//利用38译码器真值表控制显示第0位
			case(1):
				LSA = 1;LSB = 0;LSC = 0; break;//利用38译码器真值表控制显示第1位
			case(2):
				LSA = 0;LSB = 1;LSC = 0; break;//利用38译码器真值表控制显示第2位
			case(3):
				LSA = 1;LSB = 1;LSC = 0; break;//利用38译码器真值表控制显示第3位
			case(4):
				LSA = 0;LSB = 0;LSC = 1; break;//利用38译码器真值表控制显示第4位
			case(5):
				LSA = 1;LSB = 0;LSC = 1; break;//利用38译码器真值表控制显示第5位
			case(6):
				LSA = 0;LSB = 1;LSC = 1; break;//利用38译码器真值表控制显示第6位
			case(7):
				LSA = 1;LSB = 1;LSC = 1; break;//利用38译码器真值表控制显示第7位	
		}
		P0 = smgduan[i];//发送段码
		delay(); //间隔一段时间扫描	
		P0 = 0x00;//消隐,清除P0口数据以避免重影
	}
}

/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/
void main()
{	
	while(1)
	{	
		DigDisplay();  //数码管显示函数	
	}		
}
