/*************************************************************************************
实验现象：下载程序后数码管显示0，按下矩阵按键上的按键显示对应的数字
		  S1-S4：0-3
		  S5-S8：4-7
		  S9-S12：8-B
		  S13-S16：C-F。
接线说明： (具体接线图可见开发攻略对应实验的“实验现象”章节)
		   1，单片机-->静态数码管模块
		   J22-->J8
		   2，单片机-->矩阵键盘模块
		   J20-->JP3	
注意事项：行列扫描：我们可以通过高四位全部输出低电平，低四位输出高电平。
当接收到的数据，低四位不全为高电平时，说明有按键按下，然后通过接收的数据值，判断是哪一列有按键按下，
然后再反过来，高四位输出高电平，低四位输出低电平，然后根据接收到的高四位的值判断是那一行有按键按下，
这样就能够确定是哪一个按键按下了。										  
**************************************************************************************
*/
#include "reg51.h"			 //此文件中定义了单片机的一些特殊功能寄存器

#define uint unsigned int	 //宏定义两个无符号数据类型
#define uchar unsigned char

#define GPIO_DIG P0
#define GPIO_KEY P1


uchar KeyValue;	//用来存放读取到的键值


uchar code smgduan[17]={0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,
			0x90,0x88,0x83,0xc6,0xa1,0x86,0x8e};//显示0~F的值

/*******************************************************************************
* 函 数 名         : delay
* 函数功能		   : 延时函数，i=1时，大约延时10us
*******************************************************************************/
void delay(uint i){
	while(i--);	
}

/*******************************************************************************
* 函 数 名         : KeyDown
* 函数功能		   : 检测有按键按下并读取键值
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void KeyDown(void){
	char a = 0;
	GPIO_KEY = 0x0f;
	if(GPIO_KEY != 0x0f){//读取按键是否按下
		delay(1000);//延时10ms进行消抖
		if(GPIO_KEY != 0x0f){//再次检测键盘是否按下	
			//测试列
			GPIO_KEY = 0X0F;
			switch(GPIO_KEY){
				case(0X07):	KeyValue = 0;break;
				case(0X0b):	KeyValue = 1;break;
				case(0X0d): KeyValue = 2;break;
				case(0X0e):	KeyValue = 3;break;
			}
			//测试行
			GPIO_KEY = 0XF0;
			switch(GPIO_KEY){
				case(0X70):	KeyValue = KeyValue;break;
				case(0Xb0):	KeyValue = KeyValue + 4;break;
				case(0Xd0): KeyValue = KeyValue + 8;break;
				case(0Xe0):	KeyValue = KeyValue + 12;break;
			}
			
		}
	}
	while((a < 50) && (GPIO_KEY != 0xf0)){	 //检测按键松手检测
		delay(100);
		a++;
	}
}


/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/
void main(){	
	while(1){	
		KeyDown();		   //按键判断函数
		GPIO_DIG = smgduan[KeyValue];	  
	}		
}
