/*************************************************************************************
*
实验现象：下载程序后"静态数码管模块"循环显示0-F字样
接线说明： 单片机-->静态数码管模块(具体接线图可见开发攻略对应实验的“实验现象”章节)
		   J22-->J8	
注意事项：																			  
**************************************************************************************
*/

#include "reg51.h"			 //此文件中定义了单片机的一些特殊功能寄存器

#define uint unsigned int	 //宏定义两个无符号数据类型
#define uchar unsigned char	 
uint m = 0;
uint n = 16;
uchar code smgduan[17] = {0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,
			0x90,0x88,0x83,0xc6,0xa1,0x86,0x8e};//显示0~F的值
//code在这里的作用是将这个数组存放到ROM中，以降低其存储所需要的空间

void delay(void){	//1秒的延时函数
	uchar h,i,j,k;
	for(h = 5;h > 0;h--)
	for(i = 4;i > 0;i--)
	for(j = 116;j > 0;j--)
	for(k = 214;k > 0;k--);	
}	

void main(){	
	P0 = smgduan[0]; //普中51-双核-A6开发板上使用的是共阳极
	while(1){
		for(m;m < 17;m++){
			P0 = smgduan[m];
			delay();
		}
		for(n;n >= 0;n--){
			P0 = smgduan[n];
			delay();
		}
	}
}
